import 'package:flutter/material.dart';

class AtalPentionYojana extends StatelessWidget {
  const AtalPentionYojana({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          'अटल पेंशन योजना',
        ),
        centerTitle: true,
      ),
      body: Column(
        children: [
          Container(
            padding: EdgeInsets.all(20),
            child: Image.asset("assets/images/Atal_Pension_Yojana_NPS.jpg"),
            decoration: BoxDecoration(borderRadius: BorderRadius.circular(20)),
          ),
          Expanded(
              child: SingleChildScrollView(
                  scrollDirection: Axis.vertical,
                  child: Container(
                    padding: EdgeInsets.all(10),
                    child: Text("अटल पेंशन योजना प्रधानमंत्री द्वारा 9 मई, 2015 को आरंभ की गई थी। एपीवाई 18 से 40 वर्ष की आयु वर्ग के सभी बचत बैंक/डाकघर बचत बैंक खाताधारकों के लिए खुली है और चयनित पेंशन राशि के आधार पर अभिदान अलग अलग होता है। अभिदाताओं को 60 वर्ष की आयु पर गारंटीशुदा न्यूअनतम मासिक पेंशन 1000/- रूपये या 2000/- रूपये या 3000/- रूपये या 4000/- रूपये या 5000/- रूपये प्राप्त होगी। एपीवाई के अंतर्गत अभिदाताओं को मासिक पेंशन उपलब्धय होगी, और उसके पश्चा0त् उसके पति/पत्नि को प्राप्तग होगी और उनकी मृत्युप के पश्चाात्, अभिदाता की 60 वर्ष की आयु तक संचित समग्र पेंशन अभिदाता के नामिती को वापस कर दी जाएगी। न्यूलनतम पेंशन सरकार द्वारा गारंटीशुदा होगी अर्थात् यदि अभिदान के आधार पर संचित समग्र निधि निवेश पर अनुमानित रिटर्न की तुलना में कम है और न्यू नतम गारंटीशुदा पेंशन प्रदान करने के लिए अपर्याप्तर है तो केंद्र सरकार ऐसी अपर्याप्ता राशि के लिए वित्तप पोषण करेगी। वैकल्पिक रूप से निवेश पर प्राप्तस रिटर्न अधिक है तो अभिदाता को बढ़े हुए पेंशन संबंधी लाभ प्राप्तक होंगे।अभिदाता की असामयिक मृत्यु होने पर, सरकार ने अभिदाता के पति/पत्नि को अभिदाता के एपीवाई खाते में शेष बची अवधि के लिए, जब तक कि मूल अभिदाता 60 वर्ष की आयु पूरी न हो जाए, तक का विकल्प. देने का निर्णय लिया है। अभिदाता का पति/पत्नि अभिदाता के समान ही उसके पति/पत्नि की मृत्युय तक उसी पेंशन राशि को प्राप्तप करने का हकदार होगा। अभिदाता और उसके पति/पत्नि दोनों की मृत्युश के पश्चाभत्, अभिदाता का नामिती अभिदाता के 60 वर्ष तक की आयु तक संचित पेंशन लाभ को प्राप्त‍ करने का हकदार होगा। 31 मार्च, 2019 की स्थिति के अनुसार एपीवाई के अंतर्गत 6860.30 करोड़ रूपये के कुल पेंशन लाभ के साथ 149.53 लाख कुल अभिदाता नामांकित किए गए हैं।")
                  )))
        ],
      ),
    );
  }
}
