import 'package:flutter/material.dart';

class JanDhanYojana extends StatelessWidget {
  const JanDhanYojana({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          'प्रधानमंत्री जन-धन योजना',
        ),
        centerTitle: true,
      ),
      body: Column(
        children: [
          Container(
            padding: EdgeInsets.all(20),
            child:
                Image.asset("assets/images/Pradhan_Mantri_Jan_Dhan_Yojana.jpg"),
            decoration: BoxDecoration(borderRadius: BorderRadius.circular(20)),
          ),
          Expanded(
            child: SingleChildScrollView(
              scrollDirection: Axis.vertical,
              child: Container(
                padding: EdgeInsets.all(10),
                child: Text(
                    "माननीय प्रधान मंत्री ने प्रत्येक परिवार के लिए कम से कम एक मूलभूत बैंक खाता,वित्तीय साक्षरता, ऋण, बीमा और पेंशन सुविधा तक पहुंच के साथ देश के सभी परिवारों को बैंकिंग सेवाओं तक सार्वजनिक पहुंच प्रदान करते हुए व्यापक वित्तीय समावेशन सुनिश्चित करने के लिए 15 अगस्त, 2014 को अपने स्वतंत्रता दिवस संबोधन में वित्तीय समावेशन पर एक राष्ट्रीय मिशन के रूप में प्रधान मंत्री जन-धन योजना (पीएमजेडीवाई) की घोषणा की थी। इसके अंतर्गत ऐसा कोई व्यक्ति जिसका कोई बचत बैंक खाता न हो वह बिना किसी न्यूनतम शेष की आवश्यकता के एक खाता खोल सकता है तथा यदि वह स्व-प्रमाणित करता है कि उसके पास बचत खाता खोलने के लिए अपेक्षित अधिकारिक रूप से वैध कोई भी दस्तावेज नहीं है तो एक छोटा खाता खोल सकता है। इसके अतिरिक्त, बैंकिंग सेवाओं की पहुंच के विस्तार के लिए देश के 6 लाख से अधिक सभी गांवों को 1.59 लाख उप-सेवा क्षेत्रों (एसएसए) में बांटा गया था, प्रत्येक एसएसए में 1000 से 1500 परिवार होते हैं तथा 1.26 लाख एसएसए जिनमें कोई बैंक शाखा नहीं है, शाखा-रहित बैंकिंग के लिए बैंक मित्र तैनात किए गए थे।इस प्रकार, पीएमजेडीवाई में बैंक सुविधा से वंचित व्याक्तियों को बैंकिंग सेवाओं की सहज उपलब्धकता तथा वित्तीडय साक्षरता कार्यक्रम के जरिए वित्तीिय उत्पाेदों के बारे में जागरूकता सृजित करने की व्यथवस्थाई की गई है। इसके अलावा, उन्हेंो एक रूपे-डेबिट कार्ड प्राप्तस होता है, जिसमें 2 लाख रुपए का दुर्घटना बीमा कवर अंतर्निहित होता है तथा छ: माह के संतोषजनक खाता परिचालन इतिवृत्तर के आधार पर ओवरड्राफ्ट की सुविधा उपलब्धय है। इसके अतिरिक्त , माननीय प्रधानमंत्री द्वारा 09 मई, 2015 को शुभारंभ की गई सामाजिक सुरक्षा योजनाओं के जरिए सभी पात्र खाताधारक अपने बैंक खातों के माध्यीम से प्रधानमंत्री सुरक्षा बीमा योजना के अंतर्गत व्य क्तिगत दुर्घटना बीमा कवर, प्रधानमंत्री जीवन ज्योीति बीमा योजना के अंतर्गत जीवन बीमा कवर तथा अटल पेंशन योजना के अंतर्गत अभिदाताओं को गारंटीयुक्तव न्यूानतम पेंशन का लाभ प्राप्तद कर सकते हैं।पीएमजेडीवाई की अवधारणा एक सुदृढ़ नवोन्मे़षी एवं महत्वा कांक्षी मिशन के रूप में की गई थी। वर्ष 2011 की जनगणना में यह अनुमान लगाया गया था कि देश में 24.67 करोड़ परिवारों में से 14.48 करोड़ (58.7%) परिवारों के लिए बैंकिंग सेवाओं की उपलब्ध%ता थी। योजना के प्रथम चरण में योजना के आरंभ किए जाने के एक वर्ष के भीतर बैंक खाता खोलकर इन परिवारों को शामिल करने का लक्ष्य निर्धारित किया गया था। 26 जनवरी, 2015 तक वास्तंविक उपलब्धि 12.55 करोड़ थी। 27.03.2019 की स्थिति के अनुसार, खातों की संख्यात बढ़कर 35.27 करोड़ हो गई। इसके अलावा, वर्ष 2011 में केवल 0.33 लाख एसएसए में बैंकिंग सुविधा थी तथा शाखा रहित एसएसए में 1.26 लाख बैंक मित्रों के जरिए पूरे ग्रामीण भारत में बैंकिंग सेवाओं का विस्ता र किया गया था। इसका समावेशी पहलू इस तथ्यर से स्पैष्टं है कि पीएमजेडीवाई खातों में से 20.90 करोड़ (60%) खाते ग्रामीण क्षेत्रों में हैं और 18.74 करोड़ (53% से अधिक) खाताधारक महिलाएं हैं।पीएमजेडीवाई खाते के जमा आधार में समय के साथ विस्ता6र हुआ है। दिनांक 27.03.2019 की स्थिति के अनुसार पीएमजेडीवाई खाते में जमा राशि 96,107 करोड़ रुपए थी। प्रति खाते औसत जमा राशि जो मार्च, 2015 में 1,064 रुपए थी, मार्च, 2019 में बढ़कर 2,725 रुपए हो गई।बैंक मित्र नेटवर्क में भी सुदृढ़ता आई तथा इसके प्रयोग में वृद्धि हुई। बैंक मित्र द्वारा परिचालित आधार समर्थित भुगतान प्रणाली के आधार पर प्रति बैंक मित्र औसत लेन-देन जो वर्ष 2014 में 52 था वह वर्ष 2016-17 में आठ गुना से ज्या़दा बढ़कर 4,291 हो गया।"),
              ),
            ),
          )
        ],
      ),
    );
  }
}
