import 'package:flutter/material.dart';

class StandUpIndia extends StatelessWidget {
  const StandUpIndia({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          'स्टैंंड अप इंडिया योजना',
        ),
        centerTitle: true,
      ),
      body: Column(
        children: [
          Container(
            padding: EdgeInsets.all(20),
            child: Image.asset("assets/images/stand_up_india.jpg"),
            decoration: BoxDecoration(borderRadius: BorderRadius.circular(20)),
          ),
          Expanded(
              child: SingleChildScrollView(
                  scrollDirection: Axis.vertical,
                  child: Container(
                      padding: EdgeInsets.all(10),
                      child:Text("भारत सरकार ने 5 अप्रैल 2016 को स्टैं ड अप इंडिया योजना की शुरूआत की थी। योजना ग्रीनफील्डन उद्यमों को स्थाूपित करने के लिए प्रत्येअक बैंक शाखा से कम से कम एक अनुसूचित जाति/अनुसूचित जनजाति उधारकर्ता और कम से कम एक महिला उधारकर्ता को 10 लाख रूपये से 1 करोड़ रूपये के बीच के बैंक ऋण को सुकर बनाती है। ये उद्यम विनिर्माण, सेवा या व्याकपार क्षेत्र में हो सकते हैं। योजना जिसे सभी अनुसूचित वाणिज्यिक बैंकों द्वारा क्रियान्वित किया जा रहा है, को कम से कम 2.5 लाख उधारकर्ताओं को लाभ पहुंचाना है। योजना परिचालन में है और अनुसूचित वाणिज्यिक बैंकों के जरिए पूरे देश में ऋण प्रदान किए जा रहे हैं।स्टैंड अप इंडिया योजना महिलाओं, अनुसूचित जाति और अनुसूचित जनजाति श्रेणी अर्थात् जनसंख्या का ऐसा वर्ग जिन्हेंा अपर्याप्त और देर से मिलने वाले ऋण के साथ-साथ सलाह/मेंटरशिप के अभाव के कारण अत्यनधिक कठिनाइयों का सामना करना पड़ रहा है, के बीच उद्यमशीलता को प्रोत्सााहित करने का कार्य कर रही है। योजना ग्रीनफील्डन उद्यमों की शुरूआत करने के लिए जनसंख्याव के अल्प सेवित वर्गों तक पहुंच हेतु संस्थापगत ऋण संरचना में छूट का विचार रखती है। यह तत्पार एवं प्रशिक्षु दोनों प्रकार के उधारकर्ताओं की आवश्यूकताओं को पूरी करती है। संपार्श्विक मुक्तत कवरेज को आगे बढ़ाने के लिए भारत सरकार ने स्टैंतड अप इंडिया के लिए क्रेडिट गारंटी निधि (सीजीएफएसआई) की स्थामपना की है। ऋण की सुविधा प्रदान करने के अलावा स्टैंड अप इंडिया योजना संभावित उधारकर्ताओं को हैंडहोल्डिंग सहायता के विस्ताअर को भी बढ़ावा दे रही है। यह केंद्र/राज्यओ सरकार की योजनाओं के साथ शामिल करने की भी व्यववस्थाब है। योजना के अंतर्गत आवेदन आनलाइन भी किए जा सकते हैं। स्टैंड अप इंडिया पोर्टल Stand Up Mitra के रूप में इंगित एक आनलाइन निगरानी रखने हेतु प्रणाली का प्रयोग किया जा रहा है। दिनांक 31.03.2019 की स्थिति के अनुसार स्वीगकृत 16,085 करोड़ रूपये 72,983 खातों (59,429-महिला, 3,103- अनुसूचित जनजाति और 10,451-अनुसूचित जाति) में संवितरित किए गए हैं।")
                  )))
        ],
      ),
    );
  }
}
