import 'package:flutter/material.dart';

class KanyaSumangalaYojana extends StatelessWidget {
  const KanyaSumangalaYojana({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          "यू.पी मुख्यमंत्री कन्या सुमंगला योजना",
        ),
        centerTitle: true,
      ),
      body: Column(
        children: [
          Container(
            padding: EdgeInsets.all(20),
            child: Image.asset("assets/images/kanya_sumangala_large.jpeg"),
            decoration: BoxDecoration(borderRadius: BorderRadius.circular(20)),
          ),
          Expanded(
              child: SingleChildScrollView(
                  scrollDirection: Axis.vertical,
                  child: Container(
                      padding: EdgeInsets.all(10),
                      child: Text("Mukhyamantri Kanya Sumangala Yojana का उद्देश्य राज्य के नागरिकों में बालिकाओं के प्रति सकारात्मक सोच पैदा करना है जिससे भूर्ण हत्या, बाल विवाह को रोकना और लड़की-लड़के में भेदभाव को कम करना है। मुख्यमंत्री कन्या सुमंगला योजना 2022 के माध्यम से लाभार्थियों को 15000 रुपये की आर्थिक सहायता प्रदान की जाते हैं। इससे बालिकाओं के पालन पोषण एवं शिक्षा दीक्षा ने कुछ सहायता मिलेगी। योजना के लिए आवेदन फॉर्म उम्मीदवार ऑनलाइन प्राप्त कर सकते हैं। इसके लिए किसी भी लाभार्थी को किसी सरकार कार्यालय के चक्कर लगाने की आवश्यकता नहीं पड़ेगी। योजना का लाभ उन उम्मीदवारों को प्रदान किया जाएगा जिन्होंने पंजीकरण प्रकिया को पूरा किया है\n\nकन्या सुमंगला योजना के लाभ:-\n\nलाभार्थी का बैंक अकॉउंट आधार कार्ड से लिंक होना चाहिए।उम्मीदवार योजना के लिए मुफ्त में अप्लाई कर सकते है।\nयोजना के माध्यम से लोगो को जागरूक किया जाएगा।\nबालिका के जन्म होने पर 2000 रुपये प्रदान किये जाएंगे।\nपरिवार के जुड़वा बेटियों को भी योजना का लाभ दिया जाएगा।\nएक वर्ष के उपरान्त टीकाकरण करने के बाद बालिका को 1000 रुपये प्रदान किये जाएंगे।\nराज्य में एक परिवार की दो बेटियों को योजना का लाभ प्रदान किया जाएगा।\n3 गोद ली गयी बालिकाओं में से 2 बालिकाओं को योजना का लाभ दिया जाएगा।\nKanya Sumangala Yojana का लाभ अनाथ बच्चियों को भी दिया जाएगा।\nयोजना के माध्यम से प्राप्त धनराशि सीधे उम्मीदवारों के बैंक खाते में दी जायेगी।\nयोजना के माध्यम से 16000 बालिकाओं को लाभान्वित करने का निर्णय लिया गया है।\nयदि किसी परिवार ने 2 लड़कियों को गोद लिया गया है तो उनको भी योजना का लाभ प्रदान किया जाएगा।\nअब तक 27000 लोगों द्वारा आवेदन किये जा चुके हैं। इन आवेदनों में से 700 उम्मीदवारों को लाभान्वित कर दिया गया है।"))))
        ],
      ),
    );
  }
}
