import 'package:flutter/material.dart';

class VradhaPentionYojana extends StatelessWidget {
  const VradhaPentionYojana({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          "यू.पी वृद्धा पेंशन योजना",
        ),
        centerTitle: true,
      ),
      body: Column(
        children: [
          Container(
            padding: EdgeInsets.all(20),
            child: Image.asset("assets/images/vradha_pention_large.jpeg"),
            decoration: BoxDecoration(borderRadius: BorderRadius.circular(20)),
          ),
          Expanded(
              child: SingleChildScrollView(
                  scrollDirection: Axis.vertical,
                  child: Container(
                      padding: EdgeInsets.all(10),
                      child: Text("उत्तर प्रदेश वृद्धा पेंशन योजना 2021 के लिए ऑनलाइन आवेदन की प्रक्रिया है. केन्‍द्र और राज्‍य सरकार ने 60 साल से अधिक उम्र के लोगों को सामाजिक और आर्थिक सुरक्षा प्रदान करने के लिए वृद्धावस्‍था पेंशन योजना का लाभ दिया जाता है. यूपी वृद्धा पेंशन स्‍कीम के तहत 500 रुपए प्रतिमाह मिलेंगे. जो उम्‍मीदवार वृद्धावस्‍था पेंशन योजना का लाभ पाना चाहते हैं, उन्‍हें यूपी की अधिकारिक वेबसाइट sspy-up.gov.in पर जाकर लॉगइन कर आवेदन की प्रक्रिया को पूरा करना होगा. ऑनलाइन आवेदन करने वालों को भी मोबाइल नंबर देना जरूरी है. 1500 रुपए तिमाही ये पेंशन खाते में जाएगी. यही वजह है कि लाभार्थी का बैंक खाता होना भी जरूरी है. 60 साल या उससे अधिक आयु के वृद्ध इसके पात्र हैं. शहरी क्षेत्र के रहने वाले वृद्ध की वार्षिक आय 56,460 और ग्रामीण क्षेत्र में रहने वाले ऐसे बुजुर्ग जिनकी वार्षिक आय 46,080 है, वे इसके लिए आवेदन कर सकते हैं.\n\nयूपी के स्थाई निवासी ही इसका लाभ प्राप्त कर सकते हैं\nइस योजना के अंतर्गत पेंशन की राशि प्रतिमाह लाभार्थी के खाते में डायरेक्ट बेनिफिट ट्रांसफर के माध्यम से ट्रांसफर की जाती है. इसके लिए आवेदक का बैंक खाता आधार से लिंक होना अनिवार्य है. यूपी के स्थाई निवासी ही इसका लाभ प्राप्त कर सकते हैं. उत्तर प्रदेश सरकार ने इस योजना को यूपी पेंशन स्‍कीम के नाम से शुरू किया गया है. उत्तर प्रदेश के नागरिक इसके लाभार्थी बन सकते हैं. इसका उद्देश्‍य 60 साल से अधिक उम्र के बुजुर्गों को पेंशन योजना का लाभ देना है.\nयूपी पेंशन योजना के तहत वरिष्‍ठ नागरिकों को मासिक आधार पर वित्‍तीय भत्ता प्रदान करना है. प्रोत्‍साहन राशि सीधे वरिष्‍ठ नागरिकों के बैंक खाते में जमा की जाएगी. आवेदक को यूपी पेंशन योजना का लाभ पाने के लिए उत्तर प्रदेश राज्‍य का निवासी होना जरूरी है. आवेदक गरीबी रेखा से नीचे जीवन-यापन करता हो. आवेदक के पास बीपीएल का प्रमाणपत्र होना चाहिए. आवेदक समाज के आर्थिक रूप से कमजोर वर्ग का हो. वृद्धावस्‍था पेंशन पाने के लिए आवेदन करने वाले बुजुर्गों को जन्‍म और आयु प्रमाण पत्र की आवश्‍यकता होगी. इसके अलावा पहचान का प्रमाण पत्र होना चाहिए. पहचान प्रमाण पत्र में मतदाता पहचानपत्र, आधार कार्ड, राशन कार्ड का प्रयोग किया जा सकता है. इसके साथ ही बैंक पासबुक, सक्षम अधिकारी द्वारा जारी किया गया आय प्रमाण पत्र आवश्‍यक है."))))
        ],
      ),
    );
  }
}
